# Brewfile - Homebrew 패키지 목록
# 복원 방법: brew bundle install
# 마지막 업데이트: 2026-03-15

# ---------------------------------------------------------------------------
# Formulae (CLI 도구 및 라이브러리)
# ---------------------------------------------------------------------------

# AWS CLI
brew "awscli"

# Node.js 버전 관리
brew "nvm"
brew "node"
brew "node@20"
brew "yarn"

# Python
brew "python@3.11"
brew "python@3.13"
brew "uv"              # 빠른 Python 패키지 매니저

# Java / JVM
brew "openjdk@17"
brew "gradle"
brew "maven"
brew "jdtls"           # Eclipse JDT Language Server — Claude Code Java LSP 탐색용

# Go
brew "golang-migrate"
brew "golangci-lint"

# 네트워크/유틸
brew "wget"
brew "httpie"          # HTTP 클라이언트
brew "mole"            # SSH 터널링 도구

# DB
brew "mysql"
brew "mysql-client"
brew "redis"

# 개발 도구
brew "gh"              # GitHub CLI
brew "tmux"            # 터미널 멀티플렉서
brew "claude-squad"    # Claude 멀티 에이전트 관리
brew "rtk"             # LLM 토큰 절약 CLI 프록시 (60-90% 절감)
brew "subinium/tap/agf" # AI Agent Session Finder (Claude/Codex/Gemini 세션 fuzzy 검색)
brew "mas"             # Mac App Store CLI
brew "flyctl"          # Fly.io CLI

# 유틸리티
brew "convmv"          # 파일명 인코딩 변환
brew "yt-dlp"          # 동영상 다운로더 (youtube-dl 후속)

# 코드 검색 / 탐색 (token-optimization 규칙용)
brew "fd"              # 빠른 find 대체, .gitignore 자동 존중
brew "ast-grep"        # AST 기반 구문 인식 검색 (sg) — 정규식보다 정확

# ---------------------------------------------------------------------------
# Casks (GUI 앱)
# ---------------------------------------------------------------------------

cask "ngrok"           # 로컬 서버 터널링
cask "openlens"        # Kubernetes IDE
cask "discord"         # 커뮤니케이션
cask "mysqlworkbench"  # MySQL GUI
